In [3]:
import pandas as pd

In [47]:
data=pd.read_csv("C:/Users/khushal/Desktop/IIC/DA/ML/titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [48]:
data=data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [49]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [50]:
X=data.drop(['Survived'],axis=1)
y=data['Survived']

In [51]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [52]:

data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [53]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [56]:
sex_n=pd.get_dummies(data['Sex'],drop_first=True)

In [57]:
X=pd.concat([X,sex_n],axis=1)
X.head()

   Pclass     Sex   Age     Fare  male
0       3    male  22.0   7.2500     1
1       1  female  38.0  71.2833     0
2       3  female  26.0   7.9250     0
3       1  female  35.0  53.1000     0
4       3    male  35.0   8.0500     1

In [59]:
X.isna().any()

Pclass    False
Sex       False
Age        True
Fare      False
male      False
dtype: bool

In [62]:
X.Age=X.Age.fillna(X.Age.mean())

In [63]:
X.isna().any()

Pclass    False
Sex       False
Age       False
Fare      False
male      False
dtype: bool

In [77]:
from sklearn.model_selection import train_test_split

In [78]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [79]:
from sklearn.naive_bayes import GaussianNB
mod=GaussianNB()

In [70]:
X.head()

   Pclass     Sex   Age     Fare  male
0       3    male  22.0   7.2500     1
1       1  female  38.0  71.2833     0
2       3  female  26.0   7.9250     0
3       1  female  35.0  53.1000     0
4       3    male  35.0   8.0500     1

In [71]:
X=X.drop(['Sex'],axis=1)

In [75]:
X.head()

   Pclass   Age     Fare  male
0       3  22.0   7.2500     1
1       1  38.0  71.2833     0
2       3  26.0   7.9250     0
3       1  35.0  53.1000     0
4       3  35.0   8.0500     1

In [80]:
mod.fit(X_train,y_train)
pred=mod.predict(X_test)

In [86]:
from sklearn.metrics import classification_report,accuracy_score,confusion_matrix

In [90]:
print(classification_report(pred,y_test))
print(accuracy_score(pred,y_test)*100)
print(confusion_matrix(pred,y_test))

              precision    recall  f1-score   support

           0       0.85      0.84      0.85       114
           1       0.73      0.74      0.73        65

    accuracy                           0.80       179
   macro avg       0.79      0.79      0.79       179
weighted avg       0.81      0.80      0.80       179

80.44692737430168
[[96 18]
 [17 48]]